src/org-files/web.org
* Tecnologias
  1. redis
  2. nodejs
  3. javascript (typescript, ecmacsript)
* Pendiente Revisar
  1. https://caniuse.com/
  2. https://gist.github.com/sergiojunene/08c316cf80cadec4355688eb7477ce4b#postcss
  3. https://wordpress.stackexchange.com/questions/241466/functions-callback-vs-fallback
  4. https://github.com/postcss/postcss/blob/main/docs/plugins.md
  5. https://blog.aulaformativa.com/que-es-postcss/
  6. https://github.com/thecodercoder/gulp-browsersync/blob/main/gulpfile.js
  7. https://www.npmjs.com/package/gulp-terser
* GulpJS
** Instalacion
  #+BEGIN_SRC shell
    # instalamos gulp globalmente
    npm install gulp-cli -g
    # -g es igual que --global

    # inicializamos
    npm init -y

    # instalamos gulp localmente, como dependencia de desarrollo
    npm install gulp -D
    # -D es igual que --save-dev

    # instalamos dependencias
    npm install --save-dev gulp-sourcemaps gulp-concat browser-sync
    npm install --save-dev gulp-terser gulp-postcss cssnano gulp-sass autoprefixer

    # browser-sync para liveserver
  #+END_SRC
** Bibliotecas
   importantes a buscar:
   1. gulp-sourcemaps
   2. webpack-stream mezclado con gulp?

*** Servidor (Live Server)
    Podemos correr un servidor para ver los cambios en el momento desde un locahost,
    algunas bibliotecas de fácil manejo son:
    1. browser-sync
    
*** Minificar y Optimizar archivos
**** Conceptos
      1. Podemos reducir el código tanto de archivos javascript como css,
         de esta manera se demora menos segundos en cargar cada uno.
      2. Para minificar archivos javascript podemos las siguientes bibliotecas
         - gulp terser
      3. Para minificar hojas de estilos podemos usar las siguientes bibliotecas
         - nanocss
**** Gulp Terser
     - Es la nueva versión de *uglify*, sirve para ofuscar el código
     - Minimiza el código con el compatible ES6 (Ecmascript)
**** Autoprefixer
     - Es uno de los tantos plugins de [[PostCss][PostCss]]
     - Agrega los [[Prefijos Vendor][prefijos vendor]]  a las propiedades de css
     
     Referencias:
     1. https://github.com/postcss/autoprefixer
**** Nanocss
     - Es uno de los tantos plugins de [[PostCss][PostCss]]
     - Optimiza el tamaño del la hoja de estilos
     
     *Referencias:*
     1. https://github.com/cssnano/cssnano
*** Concatenar archivos
    Podemos utilizar la biblioteca **gulp-concat** para agrupar el código
    de varios archivos en uno solo. Particularmente útil cuando tenemos
    varios archivos de javascript u hojas de estilos que queremos unificar,
    colocando en las cabeceras de los html un solo archivo en vez de varios.
*** otros
**** Gulp Babel
     - Este el módulo que usará gulp para convertir el código a ES5 (Ecmascript)
     
**** PostCss
     - Herramienta con cientos de plugins que transforman estilos en css con javascript
     - Tiene cientos plugins para optimizar y mejoar el uso de las hojas de estilo
     
     *Referencias:*
     1. https://github.com/postcss/postcss
     2. https://webdesign.tutsplus.com/tutorials/postcss-quickstart-guide-instant-setup-options--cms-24536
     3. 
* Glosario
** Otros
   1. https://babeljs.io/docs/en/babel-preset-env.html 
   2. https://webdesign.tutsplus.com/series/the-command-line-for-web-design--cms-777
** Inversión de Control
*** Conceptos
*** Referencias
    1. https://es.wikipedia.org/wiki/Inversi%C3%B3n_de_control
** Prefijos Vendor
*** Conceptos
    Son prefijos que se anteponen a las propiedades de estilos que aún no están estandarizados,
    por tanto en algunos navegadores puede no verse de igual forma que en otro. Se recomienda
    no utilizarlos en un entorno de producción (el que está público listo para usar).
