dist/web.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-03-31 mié 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>‎</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfbed92f">1. Tecnologias</a></li>
<li><a href="#org27dee9b">2. Pendiente Revisar</a></li>
<li><a href="#org4f40053">3. GulpJS</a>
<ul>
<li><a href="#org1210bb0">3.1. Instalacion</a></li>
<li><a href="#orgaa46348">3.2. Bibliotecas</a>
<ul>
<li><a href="#orgcd84846">3.2.1. Servidor (Live Server)</a></li>
<li><a href="#org154b604">3.2.2. Minificar y Optimizar archivos</a></li>
<li><a href="#org29a3a35">3.2.3. Concatenar archivos</a></li>
<li><a href="#org2d9e65a">3.2.4. otros</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9944ba9">4. Glosario</a>
<ul>
<li><a href="#orgccebfd0">4.1. Otros</a></li>
<li><a href="#org46b029d">4.2. Inversión de Control</a>
<ul>
<li><a href="#orga403a46">4.2.1. Conceptos</a></li>
<li><a href="#org4566975">4.2.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org4b1e0b6">4.3. Prefijos Vendor</a>
<ul>
<li><a href="#orgf707377">4.3.1. Conceptos</a></li>
<li><a href="#org51ff6a8">4.3.2. Ejemplos</a></li>
<li><a href="#orgd580f01">4.3.3. Referencias</a></li>
</ul>
</li>
<li><a href="#orgd0f9522">4.4. Live Server</a>
<ul>
<li><a href="#orgd3a6f31">4.4.1. Referencias</a></li>
</ul>
</li>
<li><a href="#orga8d26a2">4.5. Dependencias (integrar con el otro)</a>
<ul>
<li><a href="#org97667da">4.5.1. Conceptos</a></li>
<li><a href="#org926a841">4.5.2. Referencias</a></li>
</ul>
</li>
<li><a href="#orga2bf907">4.6. Dependencias de Desarrollo (pendiente a mejorar)</a>
<ul>
<li><a href="#org609b1e0">4.6.1. Conceptos</a></li>
<li><a href="#orgabb4dff">4.6.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org3e43df5">4.7. Integración Continua (pendiente a mejorar)</a>
<ul>
<li><a href="#org73c95b9">4.7.1. Conceptos</a></li>
<li><a href="#org04cdd6c">4.7.2. Referencias</a></li>
</ul>
</li>
<li><a href="#orgf36499d">4.8. Minificación (pendiente a mejorar)</a>
<ul>
<li><a href="#orge15cc0f">4.8.1. Conceptos</a></li>
<li><a href="#orgbd861c7">4.8.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org7ffa225">4.9. Transpilado</a>
<ul>
<li><a href="#org8b5baa7">4.9.1. Conceptos</a></li>
<li><a href="#org4363c5e">4.9.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org53e3a12">4.10. Bundles</a>
<ul>
<li><a href="#orgabdb1a8">4.10.1. Conceptos</a></li>
<li><a href="#org52c9da1">4.10.2. Referencias</a></li>
</ul>
</li>
<li><a href="#orgbe7b2f9">4.11. Assets Web</a>
<ul>
<li><a href="#org86b6915">4.11.1. Conceptos</a></li>
<li><a href="#org87507a4">4.11.2. Ejemplos</a></li>
<li><a href="#org0996116">4.11.3. Referencias</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org80019c0">5. Referencias Web</a>
<ul>
<li><a href="#org67606d2">5.1. Javascript</a>
<ul>
<li><a href="#org15e69d4">5.1.1. GulpJS</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org60f2523">6. Referencias Youtube</a>
<ul>
<li><a href="#org29066cc">6.1. Javascript</a>
<ul>
<li><a href="#orgd75e95e">6.1.1. General</a></li>
<li><a href="#orgd344bfe">6.1.2. GulpJS</a></li>
</ul>
</li>
<li><a href="#org5af762f">6.2. WebSockets</a></li>
<li><a href="#org75a7d6d">6.3. Redis &amp;&amp; Node.js</a></li>
<li><a href="#orgb16ab4c">6.4. Laravel &amp;&amp; Redis &amp;&amp; Socket.io</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbed92f" class="outline-2">
<h2 id="orgfbed92f"><span class="section-number-2">1</span> Tecnologias</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>redis</li>
<li>nodejs</li>
<li>javascript (typescript, ecmacsript)</li>
</ol>
</div>
</div>
<div id="outline-container-org27dee9b" class="outline-2">
<h2 id="org27dee9b"><span class="section-number-2">2</span> Pendiente Revisar</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://caniuse.com/">https://caniuse.com/</a></li>
<li><a href="https://gist.github.com/sergiojunene/08c316cf80cadec4355688eb7477ce4b#postcss">https://gist.github.com/sergiojunene/08c316cf80cadec4355688eb7477ce4b#postcss</a></li>
<li><a href="https://wordpress.stackexchange.com/questions/241466/functions-callback-vs-fallback">https://wordpress.stackexchange.com/questions/241466/functions-callback-vs-fallback</a></li>
<li><a href="https://github.com/postcss/postcss/blob/main/docs/plugins.md">https://github.com/postcss/postcss/blob/main/docs/plugins.md</a></li>
<li><a href="https://blog.aulaformativa.com/que-es-postcss/">https://blog.aulaformativa.com/que-es-postcss/</a></li>
<li><a href="https://github.com/thecodercoder/gulp-browsersync/blob/main/gulpfile.js">https://github.com/thecodercoder/gulp-browsersync/blob/main/gulpfile.js</a></li>
<li><a href="https://www.npmjs.com/package/gulp-terser">https://www.npmjs.com/package/gulp-terser</a></li>
</ol>
</div>
</div>
<div id="outline-container-org4f40053" class="outline-2">
<h2 id="org4f40053"><span class="section-number-2">3</span> GulpJS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1210bb0" class="outline-3">
<h3 id="org1210bb0"><span class="section-number-3">3.1</span> Instalacion</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-shell"># instalamos gulp globalmente
npm install gulp-cli -g
# -g es igual que --global

# inicializamos
npm init -y

# instalamos gulp localmente, como dependencia de desarrollo
npm install gulp -D
# -D es igual que --save-dev

# instalamos dependencias
npm install --save-dev gulp-sourcemaps gulp-concat browser-sync
npm install --save-dev gulp-terser gulp-postcss cssnano gulp-sass autoprefixer

# browser-sync para liveserver
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa46348" class="outline-3">
<h3 id="orgaa46348"><span class="section-number-3">3.2</span> Bibliotecas</h3>
<div class="outline-text-3" id="text-3-2">
<p>
importantes a buscar:
</p>
<ol class="org-ol">
<li>gulp-sourcemaps</li>
<li>webpack-stream mezclado con gulp?</li>
</ol>
</div>

<div id="outline-container-orgcd84846" class="outline-4">
<h4 id="orgcd84846"><span class="section-number-4">3.2.1</span> Servidor (Live Server)</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Podemos correr un servidor para ver los cambios en el momento desde un locahost,
algunas bibliotecas de fácil manejo son:
</p>
<ol class="org-ol">
<li>browser-sync</li>
</ol>
</div>
</div>

<div id="outline-container-org154b604" class="outline-4">
<h4 id="org154b604"><span class="section-number-4">3.2.2</span> Minificar y Optimizar archivos</h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<ol class="org-ol">
<li><a id="org41ccf60"></a>Conceptos<br>
<div class="outline-text-5" id="text-3-2-2-1">
<ol class="org-ol">
<li>Podemos reducir el código tanto de archivos javascript como css,
de esta manera se demora menos segundos en cargar cada uno.</li>
<li>Para minificar archivos javascript podemos las siguientes bibliotecas
<ul class="org-ul">
<li>gulp terser</li>
</ul></li>
<li>Para minificar hojas de estilos podemos usar las siguientes bibliotecas
<ul class="org-ul">
<li>nanocss</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org06f0c16"></a>Gulp Terser<br>
<div class="outline-text-5" id="text-3-2-2-2">
<ul class="org-ul">
<li>Es la nueva versión de <b>uglify</b>, sirve para ofuscar el código</li>
<li>Minimiza el código con el compatible ES6 (Ecmascript)</li>
</ul>
</div>
</li>
<li><a id="org6665165"></a>Autoprefixer<br>
<div class="outline-text-5" id="text-3-2-2-3">
<ul class="org-ul">
<li>Es uno de los tantos plugins de <a href="#org16618fd">PostCss</a></li>
<li>Agrega los <a href="#org4b1e0b6">prefijos vendor</a>  a las propiedades de css</li>
</ul>

<p>
Referencias:
</p>
<ol class="org-ol">
<li><a href="https://github.com/postcss/autoprefixer">https://github.com/postcss/autoprefixer</a></li>
</ol>
</div>
</li>
<li><a id="org2cb7517"></a>Nanocss<br>
<div class="outline-text-5" id="text-3-2-2-4">
<ul class="org-ul">
<li>Es uno de los tantos plugins de <a href="#org16618fd">PostCss</a></li>
<li>Optimiza el tamaño del la hoja de estilos</li>
</ul>

<p>
<b>Referencias:</b>
</p>
<ol class="org-ol">
<li><a href="https://github.com/cssnano/cssnano">https://github.com/cssnano/cssnano</a></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org29a3a35" class="outline-4">
<h4 id="org29a3a35"><span class="section-number-4">3.2.3</span> Concatenar archivos</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Podemos utilizar la biblioteca <b><b>gulp-concat</b></b> para agrupar el código
de varios archivos en uno solo. Particularmente útil cuando tenemos
varios archivos de javascript u hojas de estilos que queremos unificar,
colocando en las cabeceras de los html un solo archivo en vez de varios.
</p>
</div>
</div>
<div id="outline-container-org2d9e65a" class="outline-4">
<h4 id="org2d9e65a"><span class="section-number-4">3.2.4</span> otros</h4>
<div class="outline-text-4" id="text-3-2-4">
</div>
<ol class="org-ol">
<li><a id="org10bca19"></a>Gulp Babel<br>
<div class="outline-text-5" id="text-3-2-4-1">
<ul class="org-ul">
<li>Este el módulo que usará gulp para convertir el código a ES5 (Ecmascript)</li>
</ul>
</div>
</li>

<li><a id="org16618fd"></a>PostCss<br>
<div class="outline-text-5" id="text-3-2-4-2">
<ul class="org-ul">
<li>Herramienta con cientos de plugins que transforman estilos en css con javascript</li>
<li>Tiene cientos plugins para optimizar y mejoar el uso de las hojas de estilo</li>
</ul>

<p>
<b>Referencias:</b>
</p>
<ol class="org-ol">
<li><a href="https://github.com/postcss/postcss">https://github.com/postcss/postcss</a></li>
<li><a href="https://webdesign.tutsplus.com/tutorials/postcss-quickstart-guide-instant-setup-options--cms-24536">https://webdesign.tutsplus.com/tutorials/postcss-quickstart-guide-instant-setup-options--cms-24536</a></li>
<li></li>
</ol>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9944ba9" class="outline-2">
<h2 id="org9944ba9"><span class="section-number-2">4</span> Glosario</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgccebfd0" class="outline-3">
<h3 id="orgccebfd0"><span class="section-number-3">4.1</span> Otros</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><a href="https://babeljs.io/docs/en/babel-preset-env.html">https://babeljs.io/docs/en/babel-preset-env.html</a></li>
<li><a href="https://webdesign.tutsplus.com/series/the-command-line-for-web-design--cms-777">https://webdesign.tutsplus.com/series/the-command-line-for-web-design--cms-777</a></li>
</ol>
</div>
</div>
<div id="outline-container-org46b029d" class="outline-3">
<h3 id="org46b029d"><span class="section-number-3">4.2</span> Inversión de Control</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orga403a46" class="outline-4">
<h4 id="orga403a46"><span class="section-number-4">4.2.1</span> Conceptos</h4>
</div>
<div id="outline-container-org4566975" class="outline-4">
<h4 id="org4566975"><span class="section-number-4">4.2.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-2-2">
<ol class="org-ol">
<li><a href="https://es.wikipedia.org/wiki/Inversi%C3%B3n_de_control">https://es.wikipedia.org/wiki/Inversi%C3%B3n_de_control</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4b1e0b6" class="outline-3">
<h3 id="org4b1e0b6"><span class="section-number-3">4.3</span> Prefijos Vendor</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgf707377" class="outline-4">
<h4 id="orgf707377"><span class="section-number-4">4.3.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Son prefijos que se anteponen a las propiedades de estilos que aún no están estandarizados,
por tanto en algunos navegadores puede no verse de igual forma que en otro. Se recomienda
no utilizarlos en un entorno de producción (el que está público listo para usar).
</p>
</div>
</div>
