dist/web.html
<div id="outline-container-org51ff6a8" class="outline-4">
<h4 id="org51ff6a8"><span class="section-number-4">4.3.2</span> Ejemplos</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-css" id="org7161408">-webkit-transition: all 4s ease; /* google chrome ó safari */
-moz-transition: all 4s ease; /* mozilla firefox */
-ms-transition: all 4s ease; /* internet explorer */
-o-transition: all 4s ease; /* opera */
transition: all 4s ease; 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd580f01" class="outline-4">
<h4 id="orgd580f01"><span class="section-number-4">4.3.3</span> Referencias</h4>
<div class="outline-text-4" id="text-4-3-3">
<ol class="org-ol">
<li><a href="https://developer.mozilla.org/en-US/docs/Glossary/Vendor_Prefix">https://developer.mozilla.org/en-US/docs/Glossary/Vendor_Prefix</a></li>
<li><a href="https://www.wextensible.com/articulos/vendor-prefixes/">https://www.wextensible.com/articulos/vendor-prefixes/</a></li>
<li><a href="https://css-tricks.com/how-to-deal-with-vendor-prefixes/">https://css-tricks.com/how-to-deal-with-vendor-prefixes/</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd0f9522" class="outline-3">
<h3 id="orgd0f9522"><span class="section-number-3">4.4</span> Live Server</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgd3a6f31" class="outline-4">
<h4 id="orgd3a6f31"><span class="section-number-4">4.4.1</span> Referencias</h4>
<div class="outline-text-4" id="text-4-4-1">
<ol class="org-ol">
<li><a href="https://desarrolloweb.com/articulos/servidor-desarrollo-webpack.html">https://desarrolloweb.com/articulos/servidor-desarrollo-webpack.html</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga8d26a2" class="outline-3">
<h3 id="orga8d26a2"><span class="section-number-3">4.5</span> Dependencias (integrar con el otro)</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org97667da" class="outline-4">
<h4 id="org97667da"><span class="section-number-4">4.5.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Anteriormente se utilizaba una carpeta <b>vendor</b> donde se guardaban los archivos javascript, css,
y bibliotecas de terceros.
Luego con la aparición de <b>Webpack</b> se empezó a utilizar un archivo <b>vendor.js</b> que contiene
todas las dependencias de la aplicación.
</p>

<p>
Diferencias con bower ? y al package.json?
</p>
</div>
</div>

<div id="outline-container-org926a841" class="outline-4">
<h4 id="org926a841"><span class="section-number-4">4.5.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-5-2">
<ol class="org-ol">
<li><a href="https://www.it-swarm-es.com/es/javascript/diferencia-entre-grunt-npm-y-bower-package.json-vs-bower.json/1043868077/">https://www.it-swarm-es.com/es/javascript/diferencia-entre-grunt-npm-y-bower-package.json-vs-bower.json/1043868077/</a></li>
<li><a href="https://platzi.com/blog/que-es-el-vendor-file/">https://platzi.com/blog/que-es-el-vendor-file/</a></li>
<li><a href="https://docs.npmjs.com/cli/v7/configuring-npm/package-json">https://docs.npmjs.com/cli/v7/configuring-npm/package-json</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga2bf907" class="outline-3">
<h3 id="orga2bf907"><span class="section-number-3">4.6</span> Dependencias de Desarrollo (pendiente a mejorar)</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org609b1e0" class="outline-4">
<h4 id="org609b1e0"><span class="section-number-4">4.6.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Existen dependencias para desarrollo conocidas como <b>devDependencies</b> y dependencias.
Si instalamos un paquete con <b>npm install nombrePaquete</b> se instalarán sus dependencias, 
es decir los otros paquetes que este necesita.
En cambio si usamos <b>npm install nombrePaquete –save-dev</b> sólo se instalára ese paquete,
sin sus dependencias.
</p>

<div class="org-src-container">
<pre class="src src-shell"># instalamos gulp localmente en el directorio de la aplicación
# y además sus depedencias
npm install gulp

# instalamos solo el paquete gulp-terser
# se puede reemplazar --save-dev por -D
npm install gulp-terser --save-dev

</pre>
</div>
</div>
</div>

<div id="outline-container-orgabb4dff" class="outline-4">
<h4 id="orgabb4dff"><span class="section-number-4">4.6.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-6-2">
<ol class="org-ol">
<li><a href="https://qastack.mx/programming/18875674/whats-the-difference-between-dependencies-devdependencies-and-peerdependencies">https://qastack.mx/programming/18875674/whats-the-difference-between-dependencies-devdependencies-and-peerdependencies</a></li>
<li><a href="https://qastack.mx/programming/11207638/advantages-of-bundleddependencies-over-normal-dependencies-in-npm?lq=1">https://qastack.mx/programming/11207638/advantages-of-bundleddependencies-over-normal-dependencies-in-npm?lq=1</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org3e43df5" class="outline-3">
<h3 id="org3e43df5"><span class="section-number-3">4.7</span> Integración Continua (pendiente a mejorar)</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-org73c95b9" class="outline-4">
<h4 id="org73c95b9"><span class="section-number-4">4.7.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Algunas herramientas son gitlab, travis, jenkins, hudson, circleci, .. entre otros
</p>

<p>
Los conceptos que intervienen son
</p>
<ul class="org-ul">
<li>(CI) es Continuous Integration</li>
<li>(CD) Continuous Delivery ó Entrega Continua</li>
<li>(CD) Continuous Deployment ó Despliegue Continuo</li>
</ul>
</div>
</div>

<div id="outline-container-org04cdd6c" class="outline-4">
<h4 id="org04cdd6c"><span class="section-number-4">4.7.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-7-2">
<ol class="org-ol">
<li><a href="https://www.ionos.es/digitalguide/paginas-web/desarrollo-web/herramientas-de-integracion-continua/">https://www.ionos.es/digitalguide/paginas-web/desarrollo-web/herramientas-de-integracion-continua/</a></li>
<li><a href="https://blog.nicopaez.com/2019/01/19/servidores-ci-cd-diferencias-de-modelos-jenkins-vs-circleci/">https://blog.nicopaez.com/2019/01/19/servidores-ci-cd-diferencias-de-modelos-jenkins-vs-circleci/</a></li>
<li><a href="https://spa.small-business-tracker.com/beyond-jenkins-7-devops-tools-141275">https://spa.small-business-tracker.com/beyond-jenkins-7-devops-tools-141275</a></li>
<li><a href="https://devopsti.wordpress.com/2014/09/26/integracion-continua-ci-entrega-continua-cd-y-despliegue-continuo-cd/">https://devopsti.wordpress.com/2014/09/26/integracion-continua-ci-entrega-continua-cd-y-despliegue-continuo-cd/</a></li>
<li><a href="https://geeks.ms/jorge/2019/02/25/integracion-entrega-y-despliegue-continuo-diferencias-y-similitudes/">https://geeks.ms/jorge/2019/02/25/integracion-entrega-y-despliegue-continuo-diferencias-y-similitudes/</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf36499d" class="outline-3">
<h3 id="orgf36499d"><span class="section-number-3">4.8</span> Minificación (pendiente a mejorar)</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-orge15cc0f" class="outline-4">
<h4 id="orge15cc0f"><span class="section-number-4">4.8.1</span> Conceptos</h4>
</div>
<div id="outline-container-orgbd861c7" class="outline-4">
<h4 id="orgbd861c7"><span class="section-number-4">4.8.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-8-2">
<ol class="org-ol">
<li><a href="https://docs.microsoft.com/es-es/archive/msdn-magazine/2013/october/cutting-edge-programming-css-bundling-and-minification">https://docs.microsoft.com/es-es/archive/msdn-magazine/2013/october/cutting-edge-programming-css-bundling-and-minification</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7ffa225" class="outline-3">
<h3 id="org7ffa225"><span class="section-number-3">4.9</span> Transpilado</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-org8b5baa7" class="outline-4">
<h4 id="org8b5baa7"><span class="section-number-4">4.9.1</span> Conceptos</h4>
</div>
<div id="outline-container-org4363c5e" class="outline-4">
<h4 id="org4363c5e"><span class="section-number-4">4.9.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-9-2">
<ol class="org-ol">
<li><a href="https://desarrolloweb.com/articulos/transpilado-javascript-webpack.html">https://desarrolloweb.com/articulos/transpilado-javascript-webpack.html</a></li>
<li><a href="https://desarrolloweb.com/manuales/manual-webpack.html">https://desarrolloweb.com/manuales/manual-webpack.html</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org53e3a12" class="outline-3">
<h3 id="org53e3a12"><span class="section-number-3">4.10</span> Bundles</h3>
<div class="outline-text-3" id="text-4-10">
</div>
<div id="outline-container-orgabdb1a8" class="outline-4">
<h4 id="orgabdb1a8"><span class="section-number-4">4.10.1</span> Conceptos</h4>
</div>
<div id="outline-container-org52c9da1" class="outline-4">
<h4 id="org52c9da1"><span class="section-number-4">4.10.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-10-2">
<ol class="org-ol">
<li><a href="https://www.drauta.com/que-son-los-bundles-de-symfony">https://www.drauta.com/que-son-los-bundles-de-symfony</a></li>
<li><a href="http://www.maestrosdelweb.com/curso-symfony2-proyecto-bundles/">http://www.maestrosdelweb.com/curso-symfony2-proyecto-bundles/</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbe7b2f9" class="outline-3">
<h3 id="orgbe7b2f9"><span class="section-number-3">4.11</span> Assets Web</h3>
<div class="outline-text-3" id="text-4-11">
</div>
<div id="outline-container-org86b6915" class="outline-4">
<h4 id="org86b6915"><span class="section-number-4">4.11.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-4-11-1">
<p>
Son las hojas de estilos css, los archivos javascript, las imágenes que se utilizan en el <b>frontend</b>
de las aplicaciones web, por lo general están en el directorio público de la web.
</p>
</div>
</div>
<div id="outline-container-org87507a4" class="outline-4">
<h4 id="org87507a4"><span class="section-number-4">4.11.2</span> Ejemplos</h4>
<div class="outline-text-4" id="text-4-11-2">
<pre class="example" id="ejemplo-yii-assets">A menudo es preferible gestionar los assets mediante programación.
Por ejemplo, cuando se usa el widget yii\jui\DatePicker en una página, 
éste incluirá automáticamente los archivos CSS y JavaScript requeridos, 
en vez de tener que buscar los archivos e incluirlos manualmente. 
Y cuando se actualice el widget a una nueva versión, 
ésta usará de forma automática la nueva versión de los archivos asset
</pre>
</div>
</div>
