dist/web.html
<div id="outline-container-org0996116" class="outline-4">
<h4 id="org0996116"><span class="section-number-4">4.11.3</span> Referencias</h4>
<div class="outline-text-4" id="text-4-11-3">
<ol class="org-ol">
<li><a href="https://uniwebsidad.com/libros/buenas-practicas-symfony/capitulo-10">https://uniwebsidad.com/libros/buenas-practicas-symfony/capitulo-10</a></li>
<li><a href="https://www.yiiframework.com/doc/guide/2.0/es/structure-assets">https://www.yiiframework.com/doc/guide/2.0/es/structure-assets</a></li>
<li><a href="https://www.tutorialesprogramacionya.com/angularya/detalleconcepto.php?punto=60&amp;codigo=60&amp;inicio=40">https://www.tutorialesprogramacionya.com/angularya/detalleconcepto.php?punto=60&amp;codigo=60&amp;inicio=40</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org80019c0" class="outline-2">
<h2 id="org80019c0"><span class="section-number-2">5</span> Referencias Web</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org67606d2" class="outline-3">
<h3 id="org67606d2"><span class="section-number-3">5.1</span> Javascript</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org15e69d4" class="outline-4">
<h4 id="org15e69d4"><span class="section-number-4">5.1.1</span> GulpJS</h4>
<div class="outline-text-4" id="text-5-1-1">
<ol class="org-ol">
<li><a href="https://css-tricks.com/gulp-for-beginners/">https://css-tricks.com/gulp-for-beginners/</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org60f2523" class="outline-2">
<h2 id="org60f2523"><span class="section-number-2">6</span> Referencias Youtube</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org29066cc" class="outline-3">
<h3 id="org29066cc"><span class="section-number-3">6.1</span> Javascript</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgd75e95e" class="outline-4">
<h4 id="orgd75e95e"><span class="section-number-4">6.1.1</span> General</h4>
<div class="outline-text-4" id="text-6-1-1">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=CSWnqdhN5vk&amp;ab_channel=4tomik">JS para gente que ya sabe programar</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgd344bfe" class="outline-4">
<h4 id="orgd344bfe"><span class="section-number-4">6.1.2</span> GulpJS</h4>
<div class="outline-text-4" id="text-6-1-2">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=ssG5mziTF3E">Gulp 4.0 Tutorial 2020 | Concat &amp; Minify Your CSS and JS</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5af762f" class="outline-3">
<h3 id="org5af762f"><span class="section-number-3">6.2</span> WebSockets</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=gzIcGhJC8hA">Scaling Websockets with Redis, HAProxy and Node JS</a></li>
<li><a href="https://www.youtube.com/watch?v=1BfCnjr_Vjg">WebSockets in 100 Seconds &amp; Beyond with Socket.io</a></li>
</ol>
</div>
</div>
<div id="outline-container-org75a7d6d" class="outline-3">
<h3 id="org75a7d6d"><span class="section-number-3">6.3</span> Redis &amp;&amp; Node.js</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=DbWOUste1uo&amp;ab_channel=Aprendeense%C3%B1ando">Caching en Node js usando Redis</a></li>
<li><a href="https://www.youtube.com/watch?v=BhvLIzVL8_o&amp;ab_channel=Fazt">Nodejs Curso Desde Cero, para principiantes</a></li>
<li><a href="https://www.youtube.com/watch?v=RL9mnX0qXhY">Learn how to do caching in NodeJS using Redis</a></li>
<li><a href="https://www.youtube.com/watch?v=V_9b95ecGcU&amp;list=PLTgRMOcmRb3PULeoSKL-fH1WKY3q_wGwv">Build Complex Express Sites with Redis and Socket.io</a></li>
<li><a href="https://www.youtube.com/watch?v=lYQgQFYhcQs">44.- Curso NodeJS - PubSub Redis, Express y SocketIO</a></li>
<li><a href="https://www.youtube.com/watch?v=fLZ3L9MIXAQ&amp;list=PLpOqH6AE0tNjx0SzNvlsP9-JGJ0zmuFnS&amp;ab_channel=codigofacilito">Playlist - Curso Nodejs</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgb16ab4c" class="outline-3">
<h3 id="orgb16ab4c"><span class="section-number-3">6.4</span> Laravel &amp;&amp; Redis &amp;&amp; Socket.io</h3>
<div class="outline-text-3" id="text-6-4">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=oUOQzx60zYY">Aplicaciones en tiempo real con Laravel, Socket.IO y Redis</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-31 mié 00:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>